# Introduction to _numpy_, _pandas_, and _matplotlib_

In [1]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt

In [2]:
np, pd, plt

(<module 'numpy' from 'C:\\ProgramData\\Anaconda3\\lib\\site-packages\\numpy\\__init__.py'>,
 <module 'pandas' from 'C:\\ProgramData\\Anaconda3\\lib\\site-packages\\pandas\\__init__.py'>,
 <module 'matplotlib.pyplot' from 'C:\\ProgramData\\Anaconda3\\lib\\site-packages\\matplotlib\\pyplot.py'>)

## numpy datatypes
### float32

In [3]:
x = np.float32(2 ** 127)
x, type(x)

(1.7014118e+38, numpy.float32)

### float64

In [4]:
x = np.float64(2)**1024
x, type(x)

C:\Users\JLCat\AppData\Local\Temp\ipykernel_25732\3357549316.py:1: RuntimeWarning: overflow encountered in double_scalars
  x = np.float64(2)**1024

(inf, numpy.float64)

### arrays have a fixed datatype

In [5]:
lst = [1.,2.,3.,4.,5.]
array = np.array(lst)
array, type(array), array.dtype

(array([1., 2., 3., 4., 5.]), numpy.ndarray, dtype('float64'))

In [6]:
# np.arange creates array similar to how one would use a for loop // generator
## to create a list
start = 0
end = 100
interval = 10
range_array = np.arange(start,end + 1, interval)
range_array

array([  0,  10,  20,  30,  40,  50,  60,  70,  80,  90, 100])

In [7]:
# before we were making lists in this manner
range_list = [i for i in range(start,end + 1,interval)]
range_list

[0, 10, 20, 30, 40, 50, 60, 70, 80, 90, 100]

## two dimensional lists and arrays

### Create two dimensional list

In [8]:
list_of_lists = [[1,2,3],[4,5,6],[7,8,9]]
list_of_lists

[[1, 2, 3], [4, 5, 6], [7, 8, 9]]

## transform that two dimensional list to a 
##  two dimensional array

In [9]:
two_dim_array = np.array(list_of_lists)
two_dim_array

array([[1, 2, 3],
       [4, 5, 6],
       [7, 8, 9]])

### call the 0th row of the two_dim_array

In [10]:
two_dim_array[0]

array([1, 2, 3])

### call the 0th element of the 0th row

In [11]:
two_dim_array[0][0]

1

### call the 1st element of the 0th row

In [12]:
two_dim_array[0][1]

2

### use a for loop to call the first index in the two_dim_array as $i$

### calling two_dim_array$[i]$ will yield the $i^{th}$ row

In [13]:
for i in range(len(two_dim_array)):
    print(i)
    print(two_dim_array[i])

0
[1 2 3]
1
[4 5 6]
2
[7 8 9]

### passing the row to a second for loop will cycle through 
### the second (row) index as $j$. Calling row$[j]$ will yield 
### the $j^{th}$ value from the row

In [14]:
print("i j:")
for i in range(len(two_dim_array)):
    row = two_dim_array[i]
    for j in range(len(row)):
        print(i,j)
        print("val:", row[j])

i j:
0 0
val: 1
0 1
val: 2
0 2
val: 3
1 0
val: 4
1 1
val: 5
1 2
val: 6
2 0
val: 7
2 1
val: 8
2 2
val: 9

In [15]:
for row in two_dim_array:
    print(row)
    for val in row:
        print(val)

[1 2 3]
1
2
3
[4 5 6]
4
5
6
[7 8 9]
7
8
9

## np.zeros(), np.ones(), np.empty()

## np.zeros_like(e.g., list/array), np.ones_like(), np.empty_like()

In [16]:
np.zeros((10,10))

array([[0., 0., 0., 0., 0., 0., 0., 0., 0., 0.],
       [0., 0., 0., 0., 0., 0., 0., 0., 0., 0.],
       [0., 0., 0., 0., 0., 0., 0., 0., 0., 0.],
       [0., 0., 0., 0., 0., 0., 0., 0., 0., 0.],
       [0., 0., 0., 0., 0., 0., 0., 0., 0., 0.],
       [0., 0., 0., 0., 0., 0., 0., 0., 0., 0.],
       [0., 0., 0., 0., 0., 0., 0., 0., 0., 0.],
       [0., 0., 0., 0., 0., 0., 0., 0., 0., 0.],
       [0., 0., 0., 0., 0., 0., 0., 0., 0., 0.],
       [0., 0., 0., 0., 0., 0., 0., 0., 0., 0.]])

In [17]:
np.empty((10,10))

array([[0., 0., 0., 0., 0., 0., 0., 0., 0., 0.],
       [0., 0., 0., 0., 0., 0., 0., 0., 0., 0.],
       [0., 0., 0., 0., 0., 0., 0., 0., 0., 0.],
       [0., 0., 0., 0., 0., 0., 0., 0., 0., 0.],
       [0., 0., 0., 0., 0., 0., 0., 0., 0., 0.],
       [0., 0., 0., 0., 0., 0., 0., 0., 0., 0.],
       [0., 0., 0., 0., 0., 0., 0., 0., 0., 0.],
       [0., 0., 0., 0., 0., 0., 0., 0., 0., 0.],
       [0., 0., 0., 0., 0., 0., 0., 0., 0., 0.],
       [0., 0., 0., 0., 0., 0., 0., 0., 0., 0.]])

In [18]:
np.ones((10,10))

array([[1., 1., 1., 1., 1., 1., 1., 1., 1., 1.],
       [1., 1., 1., 1., 1., 1., 1., 1., 1., 1.],
       [1., 1., 1., 1., 1., 1., 1., 1., 1., 1.],
       [1., 1., 1., 1., 1., 1., 1., 1., 1., 1.],
       [1., 1., 1., 1., 1., 1., 1., 1., 1., 1.],
       [1., 1., 1., 1., 1., 1., 1., 1., 1., 1.],
       [1., 1., 1., 1., 1., 1., 1., 1., 1., 1.],
       [1., 1., 1., 1., 1., 1., 1., 1., 1., 1.],
       [1., 1., 1., 1., 1., 1., 1., 1., 1., 1.],
       [1., 1., 1., 1., 1., 1., 1., 1., 1., 1.]])

In [19]:
l = list_of_lists
np.zeros_like(l)

array([[0, 0, 0],
       [0, 0, 0],
       [0, 0, 0]])

In [20]:
np.ones_like((l))

array([[1, 1, 1],
       [1, 1, 1],
       [1, 1, 1]])

In [21]:
np.empty_like(l)

array([[0, 0, 0],
       [0, 0, 0],
       [0, 0, 0]])

## log values

In [22]:
# np.log() uses log_e
np.log(1)

0.0

In [23]:
np.log(np.e)

1.0

In [24]:
np.log(two_dim_array)

array([[0.        , 0.69314718, 1.09861229],
       [1.38629436, 1.60943791, 1.79175947],
       [1.94591015, 2.07944154, 2.19722458]])

In [25]:
np.log10(two_dim_array)

array([[0.        , 0.30103   , 0.47712125],
       [0.60205999, 0.69897   , 0.77815125],
       [0.84509804, 0.90308999, 0.95424251]])

In [26]:
pi = np.pi
e = np.e
lne = np.log(e)
infinity = np.inf
null_val = np.nan
pi, e, lne, infinity, null_val

(3.141592653589793, 2.718281828459045, 1.0, inf, nan)

## Pandas

In [27]:
data_dict = {"0 to 9": np.arange(10),
            "ones": np.ones(10),
            "zeros":np.zeros(10)}
data_dict

{'0 to 9': array([0, 1, 2, 3, 4, 5, 6, 7, 8, 9]),
 'ones': array([1., 1., 1., 1., 1., 1., 1., 1., 1., 1.]),
 'zeros': array([0., 0., 0., 0., 0., 0., 0., 0., 0., 0.])}

In [30]:
df = pd.DataFrame(data_dict)
df

   0 to 9  ones  zeros
0       0   1.0    0.0
1       1   1.0    0.0
2       2   1.0    0.0
3       3   1.0    0.0
4       4   1.0    0.0
5       5   1.0    0.0
6       6   1.0    0.0
7       7   1.0    0.0
8       8   1.0    0.0
9       9   1.0    0.0

In [35]:
# calling a single key will return a series
df["0 to 9"], type(df["0 to 9"])

(0    0
 1    1
 2    2
 3    3
 4    4
 5    5
 6    6
 7    7
 8    8
 9    9
 Name: 0 to 9, dtype: int32,
 pandas.core.series.Series)

A dataframe is composed of one or more series
Call columns by key

In [36]:
# calling a list of keys will return a dataframe
df[["0 to 9"]]

   0 to 9
0       0
1       1
2       2
3       3
4       4
5       5
6       6
7       7
8       8
9       9

In [38]:
df[["0 to 9", "ones"]]

   0 to 9  ones
0       0   1.0
1       1   1.0
2       2   1.0
3       3   1.0
4       4   1.0
5       5   1.0
6       6   1.0
7       7   1.0
8       8   1.0
9       9   1.0

Calling by row

In [40]:
df.iloc[0]

0 to 9    0.0
ones      1.0
zeros     0.0
Name: 0, dtype: float64

In [42]:
df.loc[[0,1,2,3]]

   0 to 9  ones  zeros
0       0   1.0    0.0
1       1   1.0    0.0
2       2   1.0    0.0
3       3   1.0    0.0

very often, if you are recording values for a particular row and column, pandas will require you to use .loc to save the value in the  specified location

In [56]:
df.loc[:3, "0 to 9"]

0    0
1    1
2    2
3    3
Name: 0 to 9, dtype: int32

Row indices can be strings because indices are keys. Using df.loc[] allows you to call each row by name

In [57]:
df.T

          0    1    2    3    4    5    6    7    8    9
0 to 9  0.0  1.0  2.0  3.0  4.0  5.0  6.0  7.0  8.0  9.0
ones    1.0  1.0  1.0  1.0  1.0  1.0  1.0  1.0  1.0  1.0
zeros   0.0  0.0  0.0  0.0  0.0  0.0  0.0  0.0  0.0  0.0

In [53]:
df.T.loc["0 to 9"]

0    0.0
1    1.0
2    2.0
3    3.0
4    4.0
5    5.0
6    6.0
7    7.0
8    8.0
9    9.0
Name: 0 to 9, dtype: float64

In [58]:
df.T.iloc[0]

0    0.0
1    1.0
2    2.0
3    3.0
4    4.0
5    5.0
6    6.0
7    7.0
8    8.0
9    9.0
Name: 0 to 9, dtype: float64

Boolean arrays // boolean series

In [67]:
greater_than_3 = df["0 to 9"] > 3
greater_than_3

0    False
1    False
2    False
3    False
4     True
5     True
6     True
7     True
8     True
9     True
Name: 0 to 9, dtype: bool

In [69]:
df[greater_than_3]

   0 to 9  ones  zeros
4       4   1.0    0.0
5       5   1.0    0.0
6       6   1.0    0.0
7       7   1.0    0.0
8       8   1.0    0.0
9       9   1.0    0.0

In [70]:
df[df["0 to 9"] > 3]

   0 to 9  ones  zeros
4       4   1.0    0.0
5       5   1.0    0.0
6       6   1.0    0.0
7       7   1.0    0.0
8       8   1.0    0.0
9       9   1.0    0.0